import { IEvent } from '@/entities/event';

export const MockEventsScience: IEvent[] = [
  { id: 1, year: 1980, body: '12 февраля — запуск космического аппарата «Союз-35».' },
  { id: 2, year: 1981, body: '12 апреля — первый полёт космического челнока «Колумбия».' },
  { id: 3, year: 1982, body: '13 июня — компания IBM представила персональный компьютер IBM PC.' },
  { id: 4, year: 1983, body: '2 марта — компания Motorola представила первый коммерческий мобильный телефон.' },
  { id: 5, year: 1985, body: '23 июля — компания Commodore выпустила компьютер Amiga 1000.' },
  { id: 6, year: 1986, body: '19 февраля — запуск советской орбитальной станции «Мир».' },
];

export const MockEventsMovies: IEvent[] = [
  { id: 1, year: 1988, body: '29 июля — премьера фильма «Кто подставил кролика Роджера».' },
  { id: 2, year: 1989, body: '23 июня — выход фильма «Бэтмен».' },
  { id: 3, year: 1990, body: '16 ноября — премьера фильма «Крепкий орешек 2».' },
  { id: 4, year: 1991, body: '22 ноября — выход фильма «Молчание ягнят».' },
  { id: 5, year: 1992, body: '16 июля — премьера фильма «Бэтмен возвращается».' },
  { id: 6, year: 1994, body: '1 июля — выход фильма «Король Лев».' },
];

export const MockEventsPeople: IEvent[] = [
  { id: 1, year: 1995, body: '17 января — землетрясение в Кобе, Япония.' },
  { id: 2, year: 1996, body: '5 ноября — Билл Клинтон переизбран президентом США.' },
  { id: 3, year: 1997, body: '1 июля — Гонконг передан Китаю.' },
  { id: 4, year: 1998, body: '7 августа — теракты в посольствах США в Кении и Танзании.' },
  { id: 5, year: 1999, body: '12 марта — Чехия, Венгрия и Польша вступили в НАТО.' },
  { id: 6, year: 1999, body: '31 декабря — Владимир Путин стал исполняющим обязанности президента РФ.' },
];

export const MockEventsMisc: IEvent[] = [
  { id: 1, year: 2000, body: '31 декабря — отставка Бориса Ельцина.' },
  { id: 2, year: 2001, body: '11 сентября — террористические атаки в США.' },
  { id: 3, year: 2002, body: '1 января — введение евро в качестве наличной валюты.' },
  { id: 4, year: 2003, body: '1 февраля — катастрофа шаттла «Колумбия».' },
  { id: 5, year: 2004, body: '4 февраля — основание социальной сети Facebook.' },
  { id: 6, year: 2006, body: '22 февраля — запуск социальной сети Twitter.' },
];

export const MockEventsAnimals: IEvent[] = [
  { id: 1, year: 2007, body: 'Обнаружение новой популяции снежных барсов в Непале.' },
  { id: 2, year: 2008, body: 'Ученые обнаружили новый вид лягушек в тропических лесах Бразилии.' },
  { id: 3, year: 2009, body: 'Мировое сообщество отпраздновало 10-летие проекта по защите амурского тигра.' },
  { id: 4, year: 2010, body: 'В Новой Зеландии впервые зафиксировали рождение потомства в неволе редких киви.' },
  { id: 5, year: 2015, body: 'В Мадагаскаре обнаружена новая порода лемуров.' },
  { id: 6, year: 2019, body: 'Международный союз охраны природы объявил гималайского медведя больше не находящимся на грани вымирания.' },
];

export const MockEventsTechnology: IEvent[] = [
  { id: 1, year: 2021, body: '19 января — компания Apple представила новый iPhone 13.' },
  { id: 2, year: 2022, body: '10 февраля — запуск первого частного лунного зонда SpaceX.' },
  { id: 3, year: 2023, body: '22 марта — компания Tesla анонсировала новую модель электромобиля.' },
  { id: 4, year: 2024, body: '15 апреля — внедрение первой коммерческой квантовой сети.' },
  { id: 5, year: 2025, body: '1 июля — запуск первого марсианского туристического рейса.' },
];
